Imported down all the necessary libraries which is thankfully just Pandas

In [1]:
import pandas as pd

Read the dataset using Pandas read_csv feature

In [2]:
dataset=pd.read_csv('bbb_odi_data.csv')

C:\Users\Vijay\AppData\Local\Temp\ipykernel_6308\2538919985.py:1: DtypeWarning: Columns (41,52,53) have mixed types. Specify dtype option on import or set low_memory=False.
  dataset=pd.read_csv('bbb_odi_data.csv')

Filtered out the dataset to get the instances only where the Current run rate was <=5 during the course of the game

In [3]:
resultdf=dataset[(dataset['inns_rr']>5.00) & (dataset['inns_rr']<=6.50)]

There are several columns and I chose only the ones meaningful to the related query by using a list.

In [4]:
req_cols=['bat','batruns','ballfaced']

Now, my dataset is filtered out to get only the required columns

In [5]:
result=resultdf[req_cols]

Grouped sum of the required columns gives us the overall aggregate of the data. I've reset the columns as well to include the names as a row value in the dataset.

In [6]:
grouped=result.groupby(['bat']).sum().reset_index()

In [7]:
grouped

                    bat  batruns  ballfaced
0        AB de Villiers     4408       3946
1           Aamer Yamin       15         12
2          Aamir Kaleem        5          8
3          Aarif Sheikh      156        214
4           Aaron Finch     3086       3119
...                 ...      ...        ...
1420       Zubayr Hamza       13         24
1421      Zubin Surkari       39         82
1422     Zulfiqar Babar        1          4
1423  Zulqarnain Haider       25         30
1424    Zunaed Siddique      251        317

[1425 rows x 3 columns]

I've used this different approach to sum the dismissals because there are some run out dismissals and not always it has been the striker who has gotten out, so based on the who_out? column values summation, I've found out the number of dismissals in this specific filter.

In [8]:
dis=pd.DataFrame(resultdf['who_out?'].value_counts()).reset_index()

This is an attempt to make a similar column in both the dataframes, and use it for joins later.

In [9]:
dis.rename({'index':'bat'},axis=1,inplace=True)

In [10]:
dis

                       bat  who_out?
0              Virat Kohli       108
1         Kumar Sangakkara        96
2                 MS Dhoni        91
3     Tillakaratne Dilshan        88
4       Mahela Jayawardene        87
...                    ...       ...
1193            Gulam Bodi         1
1194           Tim Seifert         1
1195          Paras Khadka         1
1196          Manoj Tiwary         1
1197       Shahid Ahmadzai         1

[1198 rows x 2 columns]

A left join has been performed on the left dataset which is the grouped data and then they've been joined on 'bat' column

In [11]:
finalresult=pd.merge(grouped,dis,how='left',on='bat')

Now, they've been sorted by descending order of 'batruns' and this operation has been performed in place to reflect the changes

In [12]:
finalresult.sort_values(by='batruns',ascending=False,inplace=True)

The resultant column names have been renamed for easier interpretation

In [13]:
finalresult.rename({'who_out?':'dismissals','batruns':'runs','ballfaced':'balls'},axis=1,inplace=True)

In [14]:
finalresult

                       bat  runs  balls  dismissals
1371           Virat Kohli  6849   6756       108.0
752               MS Dhoni  4992   4934        91.0
701       Kumar Sangakkara  4566   4590        96.0
1075          Rohit Sharma  4432   4244        78.0
0           AB de Villiers  4408   3946        79.0
...                    ...   ...    ...         ...
717          Lahiru Gamage     0      2         NaN
952             Obed McCoy     0      1         NaN
1130  Sanjay Krishnamurthi     0      1         1.0
956           Omer Hussain     0      3         NaN
234      Cheteshwar Pujara     0      7         1.0

[1425 rows x 4 columns]

Before performing mathematical operations to find out the averages and strike rates, I've actually verified if the data types are suitable for calculations or not. Since both are of the same 'integer' type, it is easier for me to perform the operations.

In [15]:
finalresult.dtypes

bat            object
runs            int64
balls           int64
dismissals    float64
dtype: object

The averages and Runs Per Over (rpo) were calculated from the existing data and were rounded off to the 2 nearest decimal places.

In [16]:
finalresult['avg']=(finalresult['runs']/finalresult['dismissals'])
finalresult['avg']=round(finalresult['avg'],2)

In [17]:
finalresult['rpo']=(finalresult['runs']*6/finalresult['balls'])
finalresult['rpo']=round(finalresult['rpo'],2)

The end result has been saved to a csv file to use them further for visualizations on tableau

In [18]:
finalresult.to_csv('under6andhalf.csv')

In [19]:
finalresult

                       bat  runs  balls  dismissals    avg   rpo
1371           Virat Kohli  6849   6756       108.0  63.42  6.08
752               MS Dhoni  4992   4934        91.0  54.86  6.07
701       Kumar Sangakkara  4566   4590        96.0  47.56  5.97
1075          Rohit Sharma  4432   4244        78.0  56.82  6.27
0           AB de Villiers  4408   3946        79.0  55.80  6.70
...                    ...   ...    ...         ...    ...   ...
717          Lahiru Gamage     0      2         NaN    NaN  0.00
952             Obed McCoy     0      1         NaN    NaN  0.00
1130  Sanjay Krishnamurthi     0      1         1.0   0.00  0.00
956           Omer Hussain     0      3         NaN    NaN  0.00
234      Cheteshwar Pujara     0      7         1.0   0.00  0.00

[1425 rows x 6 columns]